{"review_id":"Q1sbwvVQXV2734tPgoKj4Q","user_id":"hG7b0MtEbXx5QzbzE6C_VA","business_id":"ujmEBvifdJM6h6RLv4wQIg","stars":1.0,"useful":6,"funny":1,"cool":0,"text":"Total bill for this horrible service? Over $8Gs. These crooks actually had the nerve to charge us $69 for 3 pills. I checked online the pills can be had for 19 cents EACH! Avoid Hospital ERs at all costs.","date":"2013-05-07 04:34:36"}

{"review_id":"8Edv5pKe5lOBoN5UZTUI1w","user_id":"RBXSJA372ilErzNwz0jXvQ","business_id":"ujmEBvifdJM6h6RLv4wQIg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"My family has used this ER four times in the past 2 years. Once you get past the waiting room this is a decent ER. The paid staff (docs, nurses, med assistants, etc.) all seem to have their act together (they have \"volunteers\" at the front desk but I don't know what their purpose is because the one I talked to just sat their playing with his phone and wasn't able to provide any assistance to me). The check-in can be confusing because it's all done at a kiosk and during an emergency the last thought on your mind is to walk into an ER only to have your first contact be with a kiosk instead of a human. Lastly, I wish they had an onsite pharmacy that can fill prescriptions in the middle of the night. It's frustrating to spend hours in the ER and then have to go find an open pharmacy that accepts your insurance. Overall though, it's a decent ER.","date":"2017-02-09 06:45:18"}

{"review_id":"kEs5u0cGPtiSQCLW7b0l9g","user_id":"x3brMMbJrAW9PwW5A6YL5w","business_id":"ujmEBvifdJM6h6RLv4wQIg","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"I have never been more disappointed by the care I was provided with at MountainView Hospital. I asked to be paired with an OB-GYN that came especially recommended by a friend. Unfortunately that doctor was unavailable so I was paired with Dr. Howard. (I also was put into a residency clinic, which the front desk never informed me of.) I was diagnosed with hyper emesis for the first four months of my pregnancy and had to be hospitalized. During my hospital stay I had an allergic reaction to the medication I was administered. (Medication that contained an active drug that I was allergic to.) \nThen soon after Dr. Howard left the practice and I was passed around to three different doctors. The experience was horrible and the quality of care is non-existent. This hospital does not care for its patients nor their well-being. It's disheartening that this was the experience I had to go through during my first months of my pregnancy.","date":"2018-08-14 05:25:33"}

{"review_id":"pktqfMlkfdirtOFk4fG9hA","user_id":"pB20ZDGP6DwbwCdJnPzeeQ","business_id":"FhIeCF6QrsLaRvAeu0oEPQ","stars":3.0,"useful":3,"funny":0,"cool":0,"text":"We went for lunch. It was empty except for the waitress and cook.She was nice but did not know the difference between choice and prime. The salad and garlic bread were overdressed.  I had hamburger which was good and Dave ordered the filet, which he sent back because it was overcooked and tough.","date":"2016-04-23 04:04:13"}

{"review_id":"TEyVQXcSXeSchRsMWA7XJg","user_id":"2um7BetWG3N7p3cSnXRTNw","business_id":"YzMUZjUMcgI-NSGu48-nIQ","stars":1.0,"useful":1,"funny":1,"cool":0,"text":"Dolce is not a sweet dining experience.\nThe restaurant is crowded with too many tables in the for the square footage..\nService was slow and inattentive.\nThe entrée was returned because it was too salty, no alternative was offered. \nObviously a poorly managed establishment.\n\nSave yourself the frustration and visit other Italian restaurants in the area.  Here's a link to the top 10 (notice Dolce is not one of them): http:\/\/www.10best.com\/destinations\/north-carolina\/charlotte\/restaurants\/italian\/","date":"2011-02-13 20:44:03"}

{"review_id":"LhsOGy4j0dDyGTWsiQZzeQ","user_id":"IzZ-nhD_mNa8hYelEkcQjA","business_id":"HPngBhTmMOXbQI9Noppeaw","stars":2.0,"useful":2,"funny":1,"cool":0,"text":"I have been here twice & want to keep coming but they are slow & have burnt the chicken both times. I'm going to give them one more chance.","date":"2014-12-18 00:38:54"}